[View in Colaboratory](https://colab.research.google.com/github/kaushik9728/ML-28th-May/blob/master/assignment_11.ipynb)

In [0]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [0]:
df_train=pd.read_csv('https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv')

In [0]:
df_test=pd.read_csv('https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/test.csv')

In [0]:
from sklearn.datasets import load_digits
digits=load_digits()

In [0]:
df=pd.concat([df_train,df_test])

In [15]:
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [0]:
df = df.dropna(subset=['Survived'])

In [30]:
df.shape

(891, 13)

In [17]:
print(df.isnull().sum())

Age            177
Cabin          687
Embarked         2
Fare             0
Name             0
Parch            0
PassengerId      0
Pclass           0
Sex              0
SibSp            0
Survived         0
Ticket           0
dtype: int64

In [0]:
def Has_Cabin(col):
  if pd.isnull(col):
    return 0
  else:
    return 1

In [32]:
df['Has_Cabin'].head(5)

0    0
1    0
2    0
3    0
4    0
Name: Has_Cabin, dtype: int64

In [34]:
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Has_Cabin
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,0
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,0
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,0
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,0
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,0

In [0]:
import re
df['Title'] = df.Name.apply(lambda x: re.search(' ([A-Z][a-z]+)\.', x).group(1))

In [0]:
df['Title'] = df['Title'].replace({'Mlle':'Miss', 'Mme':'Mrs', 'Ms':'Miss'})
df['Title'] = df['Title'].replace(['Don', 'Dona', 'Rev', 'Dr','Major', 'Lady', 'Sir', 'Col', 'Capt', 'Countess', 'Jonkheer'],'Special')

In [37]:
for i in range(1,4):
    print('Average passenger age of class '+str(i)+': '+str(df[df['Pclass']==i]['Age'].mean()))

Average passenger age of class 1: 38.233440860215055
Average passenger age of class 2: 29.87763005780347
Average passenger age of class 3: 25.14061971830986

In [0]:
def imputeAge(cols):
    Age = cols[0]
    Pclass = cols[1]
    
    if pd.isnull(Age):
        if Pclass == 1:
            return 39
        elif Pclass == 2:
            return 30
        else:
            return 25
    else:
        return Age

In [0]:
df['Age'] = df[['Age', 'Pclass']].apply(imputeAge, axis=1)

In [0]:
df['Fare'] = df['Fare'].fillna(df['Fare'].mean())

In [0]:
df['Categorical_age'] = pd.qcut(df['Age'], 4, labels=[1, 2, 3, 4])

In [0]:
df['Categorical_fare'] = pd.qcut(df['Fare'], 4, labels=[1, 2, 3, 4])

In [0]:
sex = pd.get_dummies(df['Sex'], drop_first=True)

get_dummies function is to convert categorical columns, Sex and Embarked into numeric ones.

For Sex column, we will now create a dummy column containing 0 and 1, where 1 is for male and 0 is for female

For Embarked column, we will create two dummy columns Q and S both containing 0 and 1:

where Q=1 denotes Queenstown, S=1 denotes Southampton, Q=0 and S=0 denotes Cherbourg

In [0]:
embark = pd.get_dummies(df['Embarked'], drop_first=True)

In [0]:
df = pd.concat([df, sex, embark], axis=1)

In [0]:
df.drop(['Cabin', 'Name', 'PassengerId', 'Ticket', 'Age', 'Fare', 'SibSp', 'Parch', 'Title', 'Sex', 'Embarked'], axis=1, inplace=True)

In [0]:
df.dropna(inplace=True)

In [50]:
X_train = df[0:891]
X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 8 columns):
Pclass              891 non-null int64
Survived            891 non-null float64
Has_Cabin           891 non-null int64
Categorical_age     891 non-null category
Categorical_fare    891 non-null category
male                891 non-null uint8
Q                   891 non-null uint8
S                   891 non-null uint8
dtypes: category(2), float64(1), int64(2), uint8(3)
memory usage: 32.6 KB

In [51]:
X_test = df[891:]
X_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 8 columns):
Pclass              0 non-null int64
Survived            0 non-null float64
Has_Cabin           0 non-null int64
Categorical_age     0 non-null category
Categorical_fare    0 non-null category
male                0 non-null uint8
Q                   0 non-null uint8
S                   0 non-null uint8
dtypes: category(2), float64(1), int64(2), uint8(3)
memory usage: 384.0 bytes

In [0]:
y_train = df_train['Survived']

In [0]:
from sklearn.linear_model import LogisticRegression

In [0]:
log = LogisticRegression()

In [55]:
log.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)